In [1]:
import pandas as pd 
import numpy as np
import openpyxl

In [2]:
dados = {
    'Time' : ['Sport', 'Santa Cruz', 'Naútico', 'São Paulo'],
    'Partidas' : [10, 10, 10, 10],
    'Vitorias' : [7, 5, 7, 9],
    'Empates': [2, 3, 5, 2],
    'Derrotas' : [12, 5, 6, 7],
    'Gols_Pro' : [2, 5, 7, 8],
    'Gols_Contra' : [23, 5, 11, 7]
    }

In [3]:
df = pd.DataFrame(dados)

In [4]:
df.head()

         Time  Partidas  Vitorias  Empates  Derrotas  Gols_Pro  Gols_Contra
0       Sport        10         7        2        12         2           23
1  Santa Cruz        10         5        3         5         5            5
2     Naútico        10         7        5         6         7           11
3   São Paulo        10         9        2         7         8            7

In [5]:
df['Vitorias'].sum().round()

df.describe()

df['Vitorias'].astype('Int64')

0    7
1    5
2    7
3    9
Name: Vitorias, dtype: Int64

In [6]:
df['Saldo_Gols'] =  df['Gols_Pro'] - df['Gols_Contra']

In [7]:
df.head()

,Time,Partidas,Vitorias,Empates,Derrotas,Gols_Pro,Gols_Contra,Saldo_Gols
0,Sport,10,7,2,12,2,23,-21
1,Santa Cruz,10,5,3,5,5,5,0
2,Naútico,10,7,5,6,7,11,-4
3,São Paulo,10,9,2,7,8,7,1

In [8]:
df["2"] = df.iloc[: , 1:].sum(axis=1)

In [9]:
df.head()

,Time,Partidas,Vitorias,Empates,Derrotas,Gols_Pro,Gols_Contra,Saldo_Gols,2
0,Sport,10,7,2,12,2,23,-21,35
1,Santa Cruz,10,5,3,5,5,5,0,33
2,Naútico,10,7,5,6,7,11,-4,42
3,São Paulo,10,9,2,7,8,7,1,44

In [10]:
df.drop(columns=['2'], inplace=True)
#or
# df.drop('2', axis=1 ,  inplace=True)

In [11]:
df.replace(10, np.nan)

,Time,Partidas,Vitorias,Empates,Derrotas,Gols_Pro,Gols_Contra,Saldo_Gols
0,Sport,NaN,7,2,12,2,23,-21
1,Santa Cruz,NaN,5,3,5,5,5,0
2,Naútico,NaN,7,5,6,7,11,-4
3,São Paulo,NaN,9,2,7,8,7,1

In [12]:
df2 = df['Vitorias'].replace(9, 20)

In [13]:
df3 = df.replace(df['Vitorias']==7, 20)

In [93]:
df3.head()

,Time,Partidas,Vitorias,Empates,Derrotas,Gols_Pro,Gols_Contra,Saldo_Gols
0,Sport,10,7,2,12,2,23,-21
1,Santa Cruz,10,5,3,5,5,5,0
2,Naútico,10,7,5,6,7,11,-4
3,São Paulo,10,9,2,7,8,7,1

In [14]:
df['Pontos'] = df['Vitorias'] * 3 + df['Empates']

In [15]:
df.head()

,Time,Partidas,Vitorias,Empates,Derrotas,Gols_Pro,Gols_Contra,Saldo_Gols,Pontos
0,Sport,10,7,2,12,2,23,-21,23
1,Santa Cruz,10,5,3,5,5,5,0,18
2,Naútico,10,7,5,6,7,11,-4,26
3,São Paulo,10,9,2,7,8,7,1,29

In [16]:
df.sort_values(by='Vitorias', ascending=False, inplace=True)

In [17]:
df.to_excel(r'../dados/excel.xlsx', index=False)